app/controllers/api/v1/repositories_controller.rb

SELECT "repositories".* FROM "repositories" ORDER BY "repositories"."name" ASC
---
      def index
        repositories = Repository.all.order(name: :asc)

SELECT "repositories".* FROM "repositories" WHERE "repositories"."name" = $1 LIMIT $2  [["name", "test-repo"], ["LIMIT", 1]]
---
      def show
        repository = Repository.find_by!(name: params[:name])

SELECT "repositories".* FROM "repositories" WHERE "repositories"."name" = $1 LIMIT $2  [["name", "test-repo"], ["LIMIT", 1]]
SELECT "packages"."name" FROM "packages" WHERE "packages"."repository_id" = $1  [["repository_id", 15]]
---
      def packages
        repository = Repository.find_by!(name: params[:name])
        packages = repository.packages.pluck(:name)

SELECT "repositories".* FROM "repositories" WHERE "repositories"."name" = $1 LIMIT $2  [["name", "build.shibboleth.net"], ["LIMIT", 1]]
---
      def status
        repository = Repository.find_by!(name: params[:name])

SELECT "repositories".* FROM "repositories" WHERE "repositories"."name" = $1 LIMIT $2  [["name", "new-repo"], ["LIMIT", 1]]
INSERT INTO "repositories" ("name", "url", "ecosystem", "last_indexed_at", "status", "error_message", "package_count", "index_size_bytes", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
      def sync
        repositories_data = params[:_json] || params[:repositories]

        unless repositories_data.is_a?(Array)
          return render json: { error: 'Expected array of repositories' }, status: :bad_request
        end

        synced = []
        repositories_data.each do |repo_data|
          repo = Repository.find_or_initialize_by(name: repo_data[:name])
          repo.url = repo_data[:url]
          repo.ecosystem = repo_data[:ecosystem] || 'maven'
          repo.status = 'pending' if repo.new_record?

          if repo.save
            synced << repo.name